Ajax/Projects/Twitter/app/models/user.rb

SELECT "follows"."followee_id" FROM "follows" WHERE "follows"."follower_id" = $1  [["follower_id", 8]]
---
  def feed_tweets(limit = nil, max_created_at = nil)
    @tweets = Tweet
      .joins(:user)
      .joins('LEFT OUTER JOIN follows ON users.id = follows.followee_id')
      .where('tweets.user_id = :id OR follows.follower_id = :id', id: self.id)
      .order('tweets.created_at DESC')
      .distinct


    # TODO: How can we use limit/max_created_at here??

    max_created_at = @tweets.maximum(:created_at)
    # THis doesnt work. You're modifying the activerecord object. Dont do that.
    # @tweets = @tweets.select { |date| date }



    @tweets.where('tweets.created_at < ?', max_created_at).limit(2)