Ajax/Projects/Twitter/app/controllers/follows_controller.rb

  def create
    # simulate latency
    sleep(1)

    @follow = current_user.out_follows.create!(followee_id: params[:user_id])
---
INSERT INTO "follows" ("followee_id", "follower_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["followee_id", 5], ["follower_id", 8], ["created_at", "2021-01-15 17:21:42.599302"], ["updated_at", "2021-01-15 17:21:42.599302"]]

  def destroy
    # simulate latency
    sleep(1)

    @follow = current_user.out_follows.find_by(followee_id: params[:user_id])
    @follow.destroy!
---
DELETE FROM "follows" WHERE "follows"."id" = $1  [["id", 1]]