Ajax/Projects/Twitter/app/controllers/tweets_controller.rb

  def create
    # simulate latency
    sleep(1)

    @tweet = current_user.tweets.build(tweet_params)

    # Modified here to render the tweet instead of changing the page. This might cause problems?
    if @tweet.save
---
INSERT INTO "tweets" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "sdfsf"], ["user_id", 9], ["created_at", "2021-01-25 04:21:23.980630"], ["updated_at", "2021-01-25 04:21:23.980630"]]