Ajax/Projects/Twitter/app/views/users/_users.json.jbuilder

SELECT "users".* FROM "users"
---
json.array!(User.all) do |user|